[
    {
        "board_games": [
            {
                "name": "Classic Wooden Chess Set",
                "seller_name": "Chess Masters",
                "seller_email": "sales@chessmasters.com",
                "price": 49.99,
                "rating": 4.7,
                "quantity_available": 10,
                "description": "Experience the timeless game of chess with this Classic Wooden Chess Set. Crafted from high-quality wood, the set features intricately carved chess pieces and a sturdy board. Whether you're a beginner or a seasoned player, this set is perfect for honing your skills and enjoying the strategic battles of chess. It's a beautiful addition to any chess enthusiast's collection.",
                "picture_url": "https://i.ibb.co/FKwNQWf/classic-Wooden-Chess-Set.png"
            },
            {
                "name": "Settlers of Catan",
                "seller_name": "Boardgame Emporium",
                "seller_email": "sales@boardgameemporium.com",
                "price": 49.99,
                "rating": 4.6,
                "quantity_available": 15,
                "description": "Settlers of Catan is a classic strategy board game where players compete to build and develop their settlements on the island of Catan. Collect resources, trade with other players, and strategically place your settlements and cities to gain points. With its modular board and dynamic gameplay, Settlers of Catan offers endless possibilities and keeps you engaged for hours of strategic fun.",
                "picture_url": "https://i.ibb.co/7WQ6xrw/settlers-Of-Catan.jpg"
            }
        ],
        "jigsaw_puzzles": [
            {
                "name": "Wildlife Adventure",
                "seller_name": "Puzzle Planet",
                "seller_email": "info@puzzleplanet.com",
                "price": 14.99,
                "rating": 4.8,
                "quantity_available": 12,
                "description": "Embark on a Wildlife Adventure with this captivating jigsaw puzzle. Explore the wonders of the animal kingdom as you piece together a vibrant collage of wildlife images. With 500 pieces, it's a perfect choice for puzzle enthusiasts of all ages. Enjoy the thrill of completing the puzzle and admire the beauty of nature.",
                "picture_url": "https://i.ibb.co/B3pGW0G/wildlife-Adventure.png"
            },
            {
                "name": "Historical Masterpieces",
                "seller_name": "Puzzle World",
                "seller_email": "info@puzzleworld.com",
                "price": 24.99,
                "rating": 4.5,
                "quantity_available": 8,
                "description": "Travel back in time with the Historical Masterpieces jigsaw puzzle. Discover iconic landmarks and famous historical scenes as you piece together this beautifully illustrated puzzle. With 1500 pieces, it offers a satisfying challenge and rewards you with a stunning masterpiece. A must-have for history enthusiasts and puzzle collectors.",
                "picture_url": "https://i.ibb.co/Hq2jGj6/historical-Masterpieces.jpg"
            }
        ],
        "mechanical_puzzles": [
            {
                "name": "Gear Maze",
                "seller_name": "Puzzle Palace",
                "seller_email": "info@puzzlepalace.com",
                "price": 9.99,
                "rating": 4.5,
                "quantity_available": 10,
                "description": "The Gear Maze is a fascinating mechanical puzzle that challenges your problem-solving skills. The objective is to manipulate the gears and guide a small ball through the maze, reaching the exit point. It's a great brain teaser for puzzle enthusiasts and a beautiful display piece for any desk or shelf.",
                "picture_url": "https://i.ibb.co/2q61TLH/GearMaze.png"
            },
            {
                "name": "Secret Lock Box",
                "seller_name": "Puzzle Masters",
                "seller_email": "support@puzzlemasters.com",
                "price": 24.99,
                "rating": 4.8,
                "quantity_available": 13,
                "description": "The Secret Lock Box is a beautifully crafted wooden puzzle box that holds a hidden compartment within. To unlock the secret, you must decipher the intricate mechanism and find the right combination of moves. It's a challenging and rewarding puzzle that doubles as an elegant storage solution for your small treasures.",
                "picture_url": "https://i.ibb.co/DDMwZ6r/secret-Lock-Box.png"
            }
        ]
    }
]